           TESTSUITE 'IDENTIFY CARD TYPE BY ACCOUNT NUMBER' 
 
           TESTCASE 'STARTS WITH 4: VISA' 
           MOVE '4111111111111111' TO IN-ACCOUNT-NUMBER
           PERFORM 2200-IDENTIFY-CARD-TYPE
           EXPECT WS-CARD-TYPE TO BE 'VISA'

           TESTCASE 'STARTS WITH 51: MASTERCARD' 
           MOVE '5111111111111111' TO IN-ACCOUNT-NUMBER
           PERFORM 2200-IDENTIFY-CARD-TYPE
           EXPECT WS-CARD-TYPE TO BE 'MASTERCARD'

           TESTCASE 'STARTS WITH 53: MASTERCARD' 
           MOVE '5311111111111111' TO IN-ACCOUNT-NUMBER
           PERFORM 2200-IDENTIFY-CARD-TYPE
           EXPECT WS-CARD-TYPE TO BE 'MASTERCARD'

           TESTCASE 'STARTS WITH 55: MASTERCARD' 
           MOVE '5511111111111111' TO IN-ACCOUNT-NUMBER
           PERFORM 2200-IDENTIFY-CARD-TYPE
           EXPECT WS-CARD-TYPE TO BE 'MASTERCARD'

           TESTCASE 'STARTS WITH 36: DINERS CLUB' 
           MOVE '3611111111111111' TO IN-ACCOUNT-NUMBER
           PERFORM 2200-IDENTIFY-CARD-TYPE
           EXPECT WS-CARD-TYPE TO BE 'DINERS CLUB'

           TESTCASE 'STARTS WITH 38: DINERS CLUB' 
           MOVE '3811111111111111' TO IN-ACCOUNT-NUMBER
           PERFORM 2200-IDENTIFY-CARD-TYPE
           EXPECT WS-CARD-TYPE TO BE 'DINERS CLUB'

           TESTCASE 'STARTS WITH 6011: DISCOVER' 
           MOVE '6011111111111111' TO IN-ACCOUNT-NUMBER
           PERFORM 2200-IDENTIFY-CARD-TYPE
           EXPECT WS-CARD-TYPE TO BE 'DISCOVER'

           TESTCASE 'STARTS WITH 65: DISCOVER' 
           MOVE '6511111111111111' TO IN-ACCOUNT-NUMBER
           PERFORM 2200-IDENTIFY-CARD-TYPE
           EXPECT WS-CARD-TYPE TO BE 'DISCOVER'

           TESTCASE 'STARTS WITH 6012: UNKNOWN' 
           MOVE '6012111111111111' TO IN-ACCOUNT-NUMBER
           PERFORM 2200-IDENTIFY-CARD-TYPE
           EXPECT WS-CARD-TYPE TO BE 'UNKNOWN'

           TESTCASE 'STARTS WITH 34: AMERICAN EXPRESS' 
           MOVE '3411111111111111' TO IN-ACCOUNT-NUMBER
           PERFORM 2200-IDENTIFY-CARD-TYPE
           EXPECT WS-CARD-TYPE TO BE 'AMERICAN EXPRESS'

           TESTCASE 'STARTS WITH 37: AMERICAN EXPRESS' 
           MOVE '3711111111111111' TO IN-ACCOUNT-NUMBER
           PERFORM 2200-IDENTIFY-CARD-TYPE
           EXPECT WS-CARD-TYPE TO BE 'AMERICAN EXPRESS'

           TESTCASE 'STARTS WITH 35: JAPAN CREDIT BUREAU' 
           MOVE '3511111111111111' TO IN-ACCOUNT-NUMBER
           PERFORM 2200-IDENTIFY-CARD-TYPE
           EXPECT WS-CARD-TYPE TO BE 'JAPAN CREDIT BUREAU'

           TESTCASE 'STARTS WITH 39: UNKNOWN' 
           MOVE '3911111111111111' TO IN-ACCOUNT-NUMBER
           PERFORM 2200-IDENTIFY-CARD-TYPE
           EXPECT WS-CARD-TYPE TO BE 'UNKNOWN'





           .
   
