      * UNIT TESTS FOR CONVERT.CBL

           DISPLAY SPACES
           DISPLAY "================================================="
           DISPLAY "CONVERT.CBL UNIT TESTS"

           MOVE "IT CONVERTS TEXT FIELD 1 TO UPPER CASE" 
               TO UT-TEST-CASE-NAME
           MOVE "SOMETHING" TO UT-EXPECTED
           MOVE "something" TO TEXT-VALUE-1
           PERFORM 2100-CONVERT-TEXT-FIELD-1
           MOVE TEXT-OUT-1 TO UT-ACTUAL
           PERFORM ASSERT-RESULT

           MOVE "IT HANDLES EMPTY TEXT FIELD 1" 
                TO UT-TEST-CASE-NAME
           MOVE SPACES TO UT-EXPECTED     
           MOVE LOW-VALUES TO TEXT-VALUE-1
           PERFORM 2100-CONVERT-TEXT-FIELD-1
           MOVE TEXT-OUT-1 TO UT-ACTUAL
           PERFORM ASSERT-RESULT

           MOVE "IT CENTERS TEXT FIELD 2 AND CAPITALIZES FIRST LETTER" 
               TO UT-TEST-CASE-NAME
           MOVE "       SOMETHING        " TO UT-EXPECTED    
           MOVE "SOMETHING" TO TEXT-VALUE-2
           PERFORM 2300-CONVERT-TEXT-FIELD-2
           MOVE TEXT-OUT-2 TO UT-ACTUAL
           PERFORM ASSERT-RESULT

           MOVE "IT HANDLES EMPTY TEXT FIELD 2" 
               TO UT-TEST-CASE-NAME
           MOVE SPACES TO UT-EXPECTED
           MOVE LOW-VALUES TO TEXT-VALUE-2
           PERFORM 2300-CONVERT-TEXT-FIELD-2
           MOVE TEXT-OUT-2 TO UT-ACTUAL
           PERFORM ASSERT-RESULT

           MOVE "IT FINDS THE STATE NAME FOR A VALID STATE CODE" 
               TO UT-TEST-CASE-NAME
           MOVE "ARIZONA" TO UT-EXPECTED    
           MOVE "AZ" TO STATE-CODE-IN
           PERFORM 2200-LOOKUP-STATE-NAME
           MOVE STATE-NAME-OUT TO UT-ACTUAL
           PERFORM ASSERT-RESULT

           MOVE "IT RETURNS SPACES FOR AN INVALID STATE CODE" 
               TO UT-TEST-CASE-NAME
           MOVE SPACES TO UT-EXPECTED
           MOVE "QR" TO STATE-CODE-IN
           PERFORM 2200-LOOKUP-STATE-NAME
           MOVE STATE-NAME-OUT TO UT-ACTUAL
           PERFORM ASSERT-RESULT

           MOVE "IT CONVERTS DECIMAL VALUE 10.45 TO 010.4500" 
               TO UT-TEST-CASE-NAME
           MOVE '0104500' TO UT-EXPECTED 
           MOVE "ALPHA,AZ,WEASEL,10.45" TO INPUT-RECORD
           PERFORM 2050-BREAK-OUT-DELIMITED-VALUES
           MOVE DECIMAL-VALUE-1-X TO UT-ACTUAL    
           PERFORM ASSERT-RESULT

           MOVE "IT CONVERTS AN EMPTY DECIMAL VALUE TO ZEROES" 
               TO UT-TEST-CASE-NAME
           MOVE '0000000' TO UT-EXPECTED    
           MOVE "ALPHA,AZ,WEASEL," TO INPUT-RECORD
           PERFORM 2050-BREAK-OUT-DELIMITED-VALUES
           MOVE DECIMAL-VALUE-1-X TO UT-ACTUAL
           PERFORM ASSERT-RESULT

           DISPLAY "================================================="

           MOVE UT-RETCODE TO RETURN-CODE
           GOBACK.

       ASSERT-RESULT.
           IF UT-ACTUAL = UT-EXPECTED
               DISPLAY UT-PASSED UT-TEST-CASE-NAME
           ELSE 
               DISPLAY UT-FAILED UT-TEST-CASE-NAME 
                   "| EXPECTED <" UT-EXPECTED ">, GOT <" UT-ACTUAL ">"
               MOVE 4 TO UT-RETCODE
           END-IF
           .
