           TESTSUITE 'CONVERT COMMA-DELIMITED FILE TO FIXED FORMAT' 

      *****************************************************************
      * COBOL COMMENTS ARE IGNORED SO YOU CAN DO THIS SORT OF THING IF
      * YOU PLEASE.
      *****************************************************************  

           MOCK FILE INPUT-FILE
           MOCK FILE   OUTPUT-FILE

           BEFORE-EACH
      *     DISPLAY 'I''M IN THE BEFORE PARAGRAPH!'
           END-BEFORE

           AFTER-EACH
      *     DISPLAY 'I''M IN THE AFTER PARAGRAPH!'
           END-AFTER

           TESTCASE      'IT CONVERTS TEXT FIELD 1 TO UPPER CASE' 
           MOVE 'something' TO TEXT-VALUE-1
           PERFORM 2100-CONVERT-TEXT-FIELD-1
           EXPECT TEXT-OUT-1 TO BE 'SOMETHING'

           TESTCASE 'IT HANDLES EMPTY TEXT FIELD 1'      
           MOVE LOW-VALUES TO TEXT-VALUE-1
           PERFORM 2100-CONVERT-TEXT-FIELD-1
           EXPECT TEXT-OUT-1 TO BE SPACES

           TESTCASE 'IT CENTERS TEXT FIELD 2 AND CAPITALIZES FIRST LETTER' 
           MOVE 'something' TO TEXT-VALUE-2
           PERFORM 2300-CONVERT-TEXT-FIELD-2
           EXPECT TEXT-OUT-2 TO BE '       Something        '   

           TESTCASE "IT HANDLES EMPTY TEXT FIELD 2" 
           MOVE SPACES TO UT-EXPECTED
           MOVE LOW-VALUES TO TEXT-VALUE-2
           PERFORM 2300-CONVERT-TEXT-FIELD-2
           EXPECT TEXT-OUT-2 TO BE SPACES

           TESTCASE "IT FINDS THE STATE NAME FOR A VALID STATE CODE" 
           MOVE "ARIZONA" TO UT-EXPECTED    
           MOVE "AZ" TO STATE-CODE-IN
           PERFORM 2200-LOOKUP-STATE-NAME
           EXPECT STATE-NAME-OUT TO BE "ARIZONA"

           TESTCASE "IT RETURNS SPACES FOR AN INVALID STATE CODE" 
           MOVE SPACES TO UT-EXPECTED
           MOVE "QR" TO STATE-CODE-IN
           PERFORM 2200-LOOKUP-STATE-NAME
           EXPECT STATE-NAME-OUT TO BE SPACES

           TESTCASE "IT CONVERTS DECIMAL VALUE 10.45 TO 010.4500" 
           MOVE '0104500' TO UT-EXPECTED 
           MOVE "ALPHA,AZ,WEASEL,10.45" TO INPUT-RECORD
           PERFORM 2050-BREAK-OUT-DELIMITED-VALUES
           EXPECT DECIMAL-VALUE-1-X TO BE '0104500'

           TESTCASE "IT CONVERTS AN EMPTY DECIMAL VALUE TO ZEROES" 
           MOVE '0000000' TO UT-EXPECTED    
           MOVE "ALPHA,AZ,WEASEL," TO INPUT-RECORD
           PERFORM 2050-BREAK-OUT-DELIMITED-VALUES
           EXPECT DECIMAL-VALUE-1-X TO BE '0000000'


