           TESTSUITE 'UNIT TESTS FOR FIZZBUZZ.CBL'
           
           TESTCASE 'IT RETURNS FIZZ FOR THE NUMBER 3 (DIVISIBLE BY 3)' 
           MOVE 3 TO CURRENT-NUMBER
           PERFORM 1000-PROCESS-NUMBER
           EXPECT CURRENT-RESULT TO BE 'FIZZ'
           
           TESTCASE 'IT CAN COMPARE NUMERIC VALUES' 
           MOVE 3 TO CURRENT-NUMBER
           PERFORM 1000-PROCESS-NUMBER
           EXPECT CURRENT-NUMBER TO BE NUMERIC 4
           
           TESTCASE 'IT CAN COMPARE 88-LEVEL VALUES' 
           MOVE 3 TO CURRENT-NUMBER
           PERFORM 1000-PROCESS-NUMBER
           EXPECT TEST-88 TO BE TRUE

           TESTCASE 'IT RETURNS FIZZ FOR THE NUMBER 6 (DIVISIBLE BY 3)' 
           MOVE 6 TO CURRENT-NUMBER
           PERFORM 1000-PROCESS-NUMBER
           EXPECT CURRENT-RESULT TO BE 'FIZZ'

           IGNORE
           TESTCASE 'IT RETURNS FIZZ FOR THE NUMBER 12 (DIVISIBLE BY 3)' 
           MOVE 12 TO CURRENT-NUMBER
           PERFORM 1000-PROCESS-NUMBER
           EXPECT CURRENT-RESULT TO BE 'FIZZ'

           TESTCASE 'IT RETURNS BUZZ FOR THE NUMBER 5 (DIVISIBLE BY 5)' 
           MOVE 5 TO CURRENT-NUMBER
           PERFORM 1000-PROCESS-NUMBER
           EXPECT CURRENT-RESULT TO BE 'BUZZ'

           TESTCASE 'IT RETURNS BUZZ FOR THE NUMBER 25 (DIVISIBLE BY 5)' 
           MOVE 25 TO CURRENT-NUMBER
           PERFORM 1000-PROCESS-NUMBER
           EXPECT CURRENT-RESULT TO BE 'BUZZ'

           TESTCASE 'IT RETURNS BUZZ FOR THE NUMBER 10 (DIVISIBLE BY 5)' 
           MOVE 100 TO CURRENT-NUMBER
           PERFORM 1000-PROCESS-NUMBER
           EXPECT CURRENT-RESULT TO BE 'BUZZ'

           TESTCASE 'IT RETURNS FIZZBUZZ FOR THE NUMBER 15 (DIV BY 3 AND 5)' 
           MOVE 15 TO CURRENT-NUMBER
           PERFORM 1000-PROCESS-NUMBER
           EXPECT CURRENT-RESULT TO BE 'FIZZBUZZ'

           TESTCASE 'IT RETURNS FIZZBUZZ FOR THE NUMBER 30 (DIV BY 3 AND 5)' 
           MOVE 30 TO CURRENT-NUMBER
           PERFORM 1000-PROCESS-NUMBER
           EXPECT CURRENT-RESULT TO BE 'FIZZBUZZ'

           TESTCASE 'IT RETURNS FIZZBUZZ FOR THE NUMBER 45 (DIV BY 3 AND 5)' 
           MOVE 45 TO CURRENT-NUMBER
           PERFORM 1000-PROCESS-NUMBER
           EXPECT CURRENT-RESULT TO BE 'FIZZBUZZ'

           TESTCASE 'IT RETURNS 4 FOR THE NUMBER 4 (NOT DIV BY 3 OR 5)' 
           MOVE 4 TO CURRENT-NUMBER
           PERFORM 1000-PROCESS-NUMBER
           EXPECT CURRENT-RESULT TO BE '0004'
