           TESTSUITE 'UNIT TESTS FOR INVDATE.CBL'

      * See the project wiki page https://github.com/neopragma/cobol-unit-test/wiki/Isolation-from-the-system-clock  
      * for an explanation of how INVDATE.CBL is isolated from the system clock.   
       
           BEFORE-EACH
           SET DO-NOT-SET-CURRENT-DATE TO TRUE
           END-BEFORE

           TESTCASE "IT DETERMINES THE NEXT INVOICE DATE IN A 30-DAY MONTH" 
           MOVE "20150405" TO WS-CURRENT-DATE
           PERFORM 2000-NEXT-INVOICE-DATE
           EXPECT WS-NEXT-INVOICE-DATE TO BE "20150430"
       
           TESTCASE "IT DETERMINES THE NEXT INVOICE DATE IN A 31-DAY MONTH" 
           MOVE "20150705" TO WS-CURRENT-DATE
           PERFORM 2000-NEXT-INVOICE-DATE
           EXPECT WS-NEXT-INVOICE-DATE TO BE "20150731"
               
           TESTCASE "IT DETERMINES THE NEXT INVOICE DATE IN FEB, NON LEAP"
           MOVE "20150205" TO WS-CURRENT-DATE
           PERFORM 2000-NEXT-INVOICE-DATE
           EXPECT WS-NEXT-INVOICE-DATE TO BE "20150228"
       
           TESTCASE "IT DETERMINES THE NEXT INVOICE DATE IN FEB, LEAP"
           MOVE "20160205" TO WS-CURRENT-DATE
           PERFORM 2000-NEXT-INVOICE-DATE
           EXPECT WS-NEXT-INVOICE-DATE TO BE "20160229"
