           TESTSUITE 'UNIT TESTS FOR SAMPLE.CBL'

           IGNORE
           TESTCASE 'IT RETURNS HELLO, WORLD! AS GREETING' 
           MOVE 'GREETING' TO WS-MESSAGE-TYPE
           PERFORM 2000-SPEAK
           EXPECT WS-MESSAGE TO BE 'HELLO, WORLD!'

           TESTCASE 'IT RETURNS GOODBYE, CRUEL WORLD! AS FAREWELL' 
           MOVE 'FAREWELL' TO WS-MESSAGE-TYPE
           PERFORM 2000-SPEAK
           EXPECT WS-MESSAGE NOT TO BE 'GOODBYE, CRUEL WORLD!'
