           TESTSUITE 'GREETING AND FAREWELL (FAREWELL WILL FAIL)'

           TESTCASE 'IT RETURNS HELLO, WORLD! AS GREETING' 
           MOVE 'GREETING' TO WS-MESSAGE-TYPE
           PERFORM 2000-SPEAK
           EXPECT WS-MESSAGE TO BE 'HELLO, WORLD!'

           TESTCASE 'IT RETURNS GOODBYE, CRUEL WORLD! AS FAREWELL' 
           MOVE 'FAREWELL' TO WS-MESSAGE-TYPE
           PERFORM 2000-SPEAK
           EXPECT WS-MESSAGE TO BE 'GOODBYE, CRUEL WORLD!'
