      **********************************************************************
      * AUTHOR:    SEBSATIEN FAUVEL
      * DATE:      25 SEPT 2019
      * PURPOSE:   DEMONSTRATE MOCKING ISSUE OF ZUTZCPC.
      **********************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. MOCKDEMO.
       ENVIRONMENT DIVISION.

       DATA DIVISION.

       WORKING-STORAGE SECTION.

       PROCEDURE DIVISION.

       1000-PARA-A.
      *  do nothing
           .

       2000-PARA-B.
      *  do nothing
           .

       9999-END.
           .